//Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
//[1,0,1,1,0,1,0,0]

/* --------- Вывод массива ---------- */
void PrintArray(int[] arr)
{
    for (int i = 0; i < arr.Length; i++)
    {
        Console.Write(arr[i] + " ");
    }
}
/* ---------------------------------- */

/* ----- Заполнение массива рандомными цифрами ----- */
void FillArrayWithRandom(int[] array, int from, int to)
{
    for (int i = 0; i < array.Length; i++)
    {
       array[i] = new Random().Next(2);
    }
}
/* ------------------------------------------------ */

/* ------- Создание массива с размером - 10 */
int[] numArray = new int[8];
/* ---------------------------------------- */

/* --------- Программа -------------- */
FillArrayWithRandom(numArray, 0, 1);

PrintArray(numArray);